app/Controllers/Api/QuizApiController.php

SELECT *
FROM `quiz_attempts`
WHERE `quiz_attempts`.`id` = '121'
---
    public function submitAnswer()
    {
        $attemptId = $this->request->getPost('attempt_id');
        $questionId = $this->request->getPost('question_id');
        $selectedOption = (int)$this->request->getPost('selected_option');

        if (!$attemptId || !$questionId || !$selectedOption) {
            return $this->response->setJSON(['success' => false, 'message' => 'All parameters are required.']);
        }

        $questionModel = new QuestionOptionModel();
        $question = $questionModel->find($questionId);
        if (!$question) {
            return $this->response->setJSON(['success' => false, 'message' => 'Question not found.']);
        }

        $attemptModel = new AttemptModel();
        $attempt = $attemptModel->find($attemptId);

SELECT COUNT(*) AS `numrows`
FROM `user_answers`
WHERE `attempt_id` = '121'
---
        $newScore = $attempt->score + $isCorrect;
        $attemptModel->updateScore($attemptId, $newScore);

        $questionsAnswered = $userAnswerModel->where('attempt_id', $attemptId)->countAllResults();

SELECT *
FROM `quiz_attempts`
WHERE `quiz_attempts`.`id` = '140'
---
    public function nextQuestion()
    {
        $attemptId = $this->request->getPost('attempt_id');
        $currentOrderIndex = (int)$this->request->getPost('current_order_index');

        if (!$attemptId) {
            return $this->response->setJSON(['success' => false, 'message' => 'Attempt ID is required.']);
        }

        $attemptModel = new AttemptModel();
        $attempt = $attemptModel->find($attemptId);

SELECT COUNT(*) AS `numrows`
FROM `questions_and_options`
WHERE `quiz_id` = '14'
AND `round_number` = '1'
SELECT COUNT(*) AS `numrows`
FROM `questions_and_options`
WHERE `quiz_id` = '14'
AND `round_number` = '1'
AND `order_index` < '1'
---
    private function getRoundProgress($quizId, $roundNumber, $orderIndex)
    {
        $db = \Config\Database::connect();

        // Count total questions in this round
        $roundTotal = $db->table('questions_and_options')
                         ->where('quiz_id', $quizId)
                         ->where('round_number', $roundNumber)
                         ->countAllResults();

        // Count how many questions in this round have order_index < current order_index
        $priorInRound = $db->table('questions_and_options')
                           ->where('quiz_id', $quizId)
                           ->where('round_number', $roundNumber)
                           ->where('order_index <', $orderIndex)
                           ->countAllResults();