app/Controllers/Auth/LoginController.php

SELECT *
FROM `admins`
WHERE `email` = 'Shivamsahaji2612@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'Shivamsahaji2612@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Check admins table first
        $adminModel = new \App\Models\AdminModel();
        $admin = $adminModel->where('email', $email)->first();

        if ($admin) {
            if (password_verify($password, $admin->password)) {
                $session->set([
                    'admin_id' => $admin->id,
                    'name'     => $admin->name,
                    'email'    => $admin->email,
                ]);
                return redirect()->to('/admin');
            }
        }

        // Check users table
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();