app/Controllers/User/DashboardController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $attemptModel = new AttemptModel();

        $totalAttempts = $attemptModel->where('user_id', $userId)->where('completed', 1)->countAllResults();

        $avgPercentage = 0;
        if ($totalAttempts > 0) {
            $avgPercentage = $attemptModel->selectAvg('percentage')
                                          ->where('user_id', $userId)
                                          ->where('completed', 1)
                                          ->first()
                                          ->percentage ?? 0;
        }

        $recentAttempts = $attemptModel->select('quiz_attempts.*, quizzes.title as quiz_title, quizzes.slug as quiz_slug')
                                        ->join('quizzes', 'quizzes.id = quiz_attempts.quiz_id', 'left')
                                        ->where('quiz_attempts.user_id', $userId)
                                        ->where('quiz_attempts.completed', 1)
                                        ->orderBy('quiz_attempts.completed_at', 'DESC')
                                        ->limit(5)
                                        ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `quiz_attempts`
WHERE `user_id` = '4'
AND `completed` = 1
SELECT `quiz_attempts`.*, `quizzes`.`title` as `quiz_title`, `quizzes`.`slug` as `quiz_slug`
FROM `quiz_attempts`
LEFT JOIN `quizzes` ON `quizzes`.`id` = `quiz_attempts`.`quiz_id`
WHERE `quiz_attempts`.`user_id` = '4'
AND `quiz_attempts`.`completed` = 1
ORDER BY `quiz_attempts`.`completed_at` DESC
 LIMIT 5