app/Views/user/dashboard.php

SELECT *
FROM `users`
WHERE `id` = '4'
---
                <div class="user-avatar-large">
                    <?php
                    $db = \Config\Database::connect();
                    $userRow = $db->table('users')->where('id', session()->get('user_id'))->get()->getRow();