app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        if (!$session->has('user_id')) {
            return redirect()->to('/login');
        }

        // Check if the user is banned in the database
        $db = \Config\Database::connect();
        $user = $db->table('users')->where('id', $session->get('user_id'))->get()->getRow();
---
SELECT *
FROM `users`
WHERE `id` = '4'