app/Controllers/HomeController.php

    public function index()
    {
        $quizModel = new QuizModel();
        $categoryModel = new CategoryModel();

        // Retrieve categories and active quizzes
        $categories = $categoryModel->findAll();
        $quizzes = $quizModel->select('quizzes.*, categories.name as category_name')
                             ->join('categories', 'categories.id = quizzes.category_id', 'left')
                             ->where('quizzes.is_active', 1)
                             ->findAll();
---
SELECT *
FROM `categories`
SELECT `quizzes`.*, `categories`.`name` as `category_name`
FROM `quizzes`
LEFT JOIN `categories` ON `categories`.`id` = `quizzes`.`category_id`
WHERE `quizzes`.`is_active` = 1