app/Models/AdSettingModel.php

    public function getAllSettings(): array
    {
        $rows = $this->findAll();
---
SELECT *
FROM `ad_settings`