app/Models/AttemptModel.php

SELECT COUNT(*) AS `numrows`
FROM `questions_and_options`
WHERE `quiz_id` = '14'
INSERT INTO `quiz_attempts` (`quiz_id`, `user_id`, `guest_token`, `score`, `total_questions`, `percentage`, `completed`, `started_at`, `created_at`, `updated_at`) VALUES ('14', NULL, 'guest_ebad8ec00c30ff50', 0, 80, 0, 0, '2026-07-15 08:53:40', '2026-07-15 08:53:40', '2026-07-15 08:53:40')
---
    public function createAttempt($quiz_id, $user_id, $guest_token)
    {
        $db = \Config\Database::connect();
        $totalQuestions = $db->table('questions_and_options')->where('quiz_id', $quiz_id)->countAllResults();

        $data = [
            'quiz_id'         => $quiz_id,
            'user_id'         => $user_id ?: null,
            'guest_token'     => $guest_token ?: null,
            'score'           => 0,
            'total_questions' => $totalQuestions,
            'percentage'      => 0.00,
            'completed'       => 0,
            'started_at'      => date('Y-m-d H:i:s'),
        ];

        $this->insert($data);

UPDATE `quiz_attempts` SET `score` = 0, `updated_at` = '2026-07-15 08:54:57'
WHERE `quiz_attempts`.`id` IN ('121')
---
    public function updateScore($attempt_id, $score)
    {
        return $this->update($attempt_id, [
            'score'      => $score,
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

UPDATE `quizzes` SET `total_attempts` = `total_attempts` + 1
WHERE `id` = '14'
---
    public function incrementQuizAttempts($quiz_id)
    {
        $db = \Config\Database::connect();
        return $db->table('quizzes')->where('id', $quiz_id)->increment('total_attempts', 1);