app/Models/UserAnswerModel.php

    public function saveAnswer($attempt_id, $question_id, $selected_option, $is_correct)
    {
        $data = [
            'attempt_id'      => $attempt_id,
            'question_id'     => $question_id,
            'selected_option' => $selected_option,
            'is_correct'      => $is_correct,
            'answered_at'     => date('Y-m-d H:i:s'),
        ];
        return $this->insert($data);
---
INSERT INTO `user_answers` (`attempt_id`, `question_id`, `selected_option`, `is_correct`, `answered_at`, `created_at`, `updated_at`) VALUES ('121', '679', 2, 0, '2026-07-15 08:54:57', '2026-07-15 08:54:57', '2026-07-15 08:54:57')